from tkinter import *                              # імпортування графічної бібліотеки

root = Tk()                                        # створення головного вікна

c = Canvas(root, width=500, height=400)            # створення полотна шириною 500 та висотою 300
c.pack()

c.create_line(15, 10, 115, 50)                     # малювання лінії з початком в точці (15,10) та кінцем (485,290)

c.create_line(40, 150, 110, 50,                    # координати другої лінії
              fill='red',                          # колір лінії 
              width=5,                             # ширина лінії
              dash=(10, 2),                        # для малювання штрихами (довжина пунктиру, довжина пропуску)
              activefill='yellow',                 # колір лінії, коли над нею мишка
              arrow=LAST,                          # розміщення стрілки в кінці лінії
              arrowshape="10 30 10")               # розміри стрілки

c.create_rectangle(310, 10, 400, 190)              # малювання першого прямокутника з лівою верхньою вершиною (10,10) та правою 
                                                   # нижньою (100,190)

c.create_rectangle(320, 50, 490, 120,              # вершини другого прямокутника
                   fill='lightpink',               # колір заливки
                   outline='blue',                 # колір межі
                   width=3,                        # ширина межі
                   activedash=(5, 4))              # коли над прямокутником миша, межа стає штриховою

c.create_oval(10, 200, 190, 310)                    # малювання першого овалу

c.create_oval(50, 205, 150, 305,                   # вершини прямокутника, у який вписується овал
              width=10,                            # ширина межі
              fill='lightyellow',                  # колір заливки
              outline='lightgreen')                # колір межі

c.create_polygon(300, 210, 160, 380, 320, 290,        # координати вершин трикутника
                 fill='orange',                    # колір заливки
                 outline='black')                  # колір межі

points = [170, 140, 180, 110, 210, 100, 180, 90, 170, 60, 160, 90, 130, 100, 160, 110]

c.create_polygon(points,
                 outline='green',
                 fill='lightblue',
                 width=3)

c.create_text(450, 300,                            # координати центрування тексту
              text="I like \nTkinter!",            # текст, що відображатиметься на полотні
              justify=CENTER,                      # вирівнювання тексту по центру
              font="Verdana 14")                   # тип і розмір шрифту

root.mainloop()                                    # задання команди відображення вікна при запуску